### JOINING DATA WITH PANDAS

**Create two data that join**

In [50]:
import pandas as pd

data1 = {
    'name': ['Ram', 'Samir', 'Pawan', 'Sita', 'Rita'],
    'rollno': [1, 2, 3, 4, 5],
    'age': [20, 21, 19, 22, 24],
    'height': [160, 170, 165, 180, 158]
}
df1 = pd.DataFrame(data1)


data2 = {
    'rollno': [1, 2, 3, 4, 5],
    'total_marks': [450, 380, 290, 410, 320],  # out of 500
    'percentage': [90.0, 76.0, 58.0, 82.0, 64.0],
    'grade': ['A', 'B', 'C', 'A', 'B']
}
df2 = pd.DataFrame(data2)

# Output the DataFrames
print(f"DataFrame 1:{df1.shape} \n{df1}")
print(f"\nDataFrame 2:{df2.shape} \n{df2}")

DataFrame 1:(5, 4)
    name  rollno  age  height
0    Ram       1   20     160
1  Samir       2   21     170
2  Pawan       3   19     165
3   Sita       4   22     180
4   Rita       5   24     158

DataFrame 2:(5, 4)
   rollno  total_marks  percentage grade
0       1          450        90.0     A
1       2          380        76.0     B
2       3          290        58.0     C
3       4          410        82.0     A
4       5          320        64.0     B

**Inner join ( common join )**   
   If we want to merge the DataFrames, we need at least one common column between them.  
   here rolllno column are common

In [51]:
#REMOVE COLUMN
# df1 = df1.drop(columns=['rollno'])
# df2 = df2.drop(columns=['rollno'])

# print(f"DataFrame 1: {df1.shape} \n{df1}")
# print(f"\nDataFrame 2: {df2.shape} \n{df2}")


inner_join = df1.merge(df2 )
print(f"\nDataFrame 2: {inner_join.shape} \n{inner_join}")

#  add suffixes into different table 
#  if both table have same column name more then one only suffixes are used 
df2['age'] = [20, 22, 19, 21, 24]
inner_join_suff = df1.merge(df2 , on ='rollno', suffixes =('_1','_2'))
print(f"\nDataFrame 2: {inner_join_suff.shape} \n{inner_join_suff}")

DataFrame 2: (5, 7)
    name  rollno  age  height  total_marks  percentage grade
0    Ram       1   20     160          450        90.0     A
1  Samir       2   21     170          380        76.0     B
2  Pawan       3   19     165          290        58.0     C
3   Sita       4   22     180          410        82.0     A
4   Rita       5   24     158          320        64.0     B

DataFrame 2: (5, 8)
    name  rollno  age_1  height  total_marks  percentage grade  age_2
0    Ram       1     20     160          450        90.0     A     20
1  Samir       2     21     170          380        76.0     B     22
2  Pawan       3     19     165          290        58.0     C     19
3   Sita       4     22     180          410        82.0     A     21
4   Rita       5     24     158          320        64.0     B     24

**One to many relationships**  
the number of row into two table are different

In [65]:
new_data = pd.DataFrame([{'rollno': 10,'age': 23,'total_marks': 400,'percentage': 80.0,'grade': 'B'}])
df2 = pd.concat([df2 , new_data],ignore_index=True)
print(df2)

one_to_many = df1.merge(df2 ,on ='rollno')
print(f"\nDataFrame 2: {one_to_many.shape} \n{one_to_many}")

   rollno  total_marks  percentage grade  age
0       1          450        90.0     A   20
1       2          380        76.0     B   22
2       3          290        58.0     C   19
3       4          410        82.0     A   21
4       5          320        64.0     B   24
5       8          400        80.0     B   23
6       9          400        80.0     B   23
7      10          400        80.0     B   23

DataFrame 2: (5, 8)
    name  rollno  age_x  height  total_marks  percentage grade  age_y
0    Ram       1     20     160          450        90.0     A     20
1  Samir       2     21     170          380        76.0     B     22
2  Pawan       3     19     165          290        58.0     C     19
3   Sita       4     22     180          410        82.0     A     21
4   Rita       5     24     158          320        64.0     B     24

**Left join**  
the table of left is same order and the right table is arrange according to th age in left table

In [53]:
left_join = df1.merge(df2 ,on = 'age',how ='left')
print(left_join)
# df2['age'] = [20, 22, 19, 21, 24]
#   'age': [20, 21, 19, 22, 24],
# here age 21 in left table match with rollno 4 in right table

    name  rollno_x  age  height  rollno_y  total_marks  percentage grade
0    Ram         1   20     160         1          450        90.0     A
1  Samir         2   21     170         4          410        82.0     A
2  Pawan         3   19     165         3          290        58.0     C
3   Sita         4   22     180         2          380        76.0     B
4   Rita         5   24     158         5          320        64.0     B

**Right merge**  
The table of right is same order and the left table is arrange according to th age in right table

In [66]:
right_join = df1.merge(df2 ,on ='rollno' ,how= 'right')
print(right_join)
#   df2['age'] = [20, 22, 19, 21, 24]
#   'age': [20, 21, 19, 22, 24],

right_join_on = df1.merge(df2 ,left_on ='age' ,right_on= 'rollno' ,how= 'right')
print(f"\n{right_join_on}")

# bec

    name  rollno  age_x  height  total_marks  percentage grade  age_y
0    Ram       1   20.0   160.0          450        90.0     A     20
1  Samir       2   21.0   170.0          380        76.0     B     22
2  Pawan       3   19.0   165.0          290        58.0     C     19
3   Sita       4   22.0   180.0          410        82.0     A     21
4   Rita       5   24.0   158.0          320        64.0     B     24
5    NaN       8    NaN     NaN          400        80.0     B     23
6    NaN       9    NaN     NaN          400        80.0     B     23
7    NaN      10    NaN     NaN          400        80.0     B     23

  name  rollno_x  age_x  height  rollno_y  total_marks  percentage grade  \
0  NaN       NaN    NaN     NaN         1          450        90.0     A
1  NaN       NaN    NaN     NaN         2          380        76.0     B
2  NaN       NaN    NaN     NaN         3          290        58.0     C
3  NaN       NaN    NaN     NaN         4          410        82.0     A
4  NaN       NaN    NaN     NaN         5          320        64.0     B
5  NaN       NaN    NaN     NaN         8          400        80.0     B
6  NaN       NaN    NaN     NaN         9          400        80.0     B
7  NaN       NaN    NaN     NaN        10          400        80.0     B

   age_y
0     20
1     22
2     19
3     21
4     24
5     23
6     23
7     23

**Outer join**

In [67]:
outer_join = df1.merge(df2 , on ='rollno', how = 'outer')
print(outer_join)

    name  rollno  age_x  height  total_marks  percentage grade  age_y
0    Ram       1   20.0   160.0          450        90.0     A     20
1  Samir       2   21.0   170.0          380        76.0     B     22
2  Pawan       3   19.0   165.0          290        58.0     C     19
3   Sita       4   22.0   180.0          410        82.0     A     21
4   Rita       5   24.0   158.0          320        64.0     B     24
5    NaN       8    NaN     NaN          400        80.0     B     23
6    NaN       9    NaN     NaN          400        80.0     B     23
7    NaN      10    NaN     NaN          400        80.0     B     23

**Self join  on rolllno**  
  self join on rollno and age is empty

In [56]:
self_join = df1.merge(df1 ,left_on='rollno',right_on='rollno')
print(self_join)

self_join_e = df1.merge(df1 ,left_on='rollno',right_on='age')
print(self_join_e)

  name_x  rollno  age_x  height_x name_y  age_y  height_y
0    Ram       1     20       160    Ram     20       160
1  Samir       2     21       170  Samir     21       170
2  Pawan       3     19       165  Pawan     19       165
3   Sita       4     22       180   Sita     22       180
4   Rita       5     24       158   Rita     24       158
Empty DataFrame
Columns: [name_x, rollno_x, age_x, height_x, name_y, rollno_y, age_y, height_y]
Index: []

**Merging on indexes**    
   Merging on the basic of the index of the table

In [57]:
m_index1 = df1.set_index('rollno')
m_index2 = df2.set_index('rollno')

# merge on basic of rollno
merge_index = m_index1.merge(m_index2, right_index=True,left_index=True)
print(merge_index)

         name  age_x  height  total_marks  percentage grade  age_y
rollno
1         Ram     20     160          450        90.0     A     20
2       Samir     21     170          380        76.0     B     22
3       Pawan     19     165          290        58.0     C     19
4        Sita     22     180          410        82.0     A     21
5        Rita     24     158          320        64.0     B     24

**Filtering joins**   
  **semi join** : only data that have in both table are present

In [68]:
semi_join = df1.merge(df2,on='rollno')
print(semi_join)
print(df1['rollno'].isin(semi_join['rollno']))
print(df2['rollno'].isin(semi_join['rollno']))
print(df1[df1['rollno'].isin(semi_join['rollno'])])

    name  rollno  age_x  height  total_marks  percentage grade  age_y
0    Ram       1     20     160          450        90.0     A     20
1  Samir       2     21     170          380        76.0     B     22
2  Pawan       3     19     165          290        58.0     C     19
3   Sita       4     22     180          410        82.0     A     21
4   Rita       5     24     158          320        64.0     B     24
0    True
1    True
2    True
3    True
4    True
Name: rollno, dtype: bool
0     True
1     True
2     True
3     True
4     True
5    False
6    False
7    False
Name: rollno, dtype: bool
    name  rollno  age  height
0    Ram       1   20     160
1  Samir       2   21     170
2  Pawan       3   19     165
3   Sita       4   22     180
4   Rita       5   24     158

**Anti merge** :  _print the data only present in one table in may be left and right_

In [69]:
anti_join = df1.merge(df2,on ='rollno',how='right',indicator=True)
print(f"\n{anti_join}")
anti_join_right = anti_join.loc[anti_join['_merge']=='right_only','rollno']
print(f"\n{anti_join_right}")

# data only present in the right table is print
print(f"\n{df2[df2['rollno'].isin(anti_join_right)]}")

    name  rollno  age_x  height  total_marks  percentage grade  age_y  \
0    Ram       1   20.0   160.0          450        90.0     A     20
1  Samir       2   21.0   170.0          380        76.0     B     22
2  Pawan       3   19.0   165.0          290        58.0     C     19
3   Sita       4   22.0   180.0          410        82.0     A     21
4   Rita       5   24.0   158.0          320        64.0     B     24
5    NaN       8    NaN     NaN          400        80.0     B     23
6    NaN       9    NaN     NaN          400        80.0     B     23
7    NaN      10    NaN     NaN          400        80.0     B     23

       _merge
0        both
1        both
2        both
3        both
4        both
5  right_only
6  right_only
7  right_only

5     8
6     9
7    10
Name: rollno, dtype: int64

   rollno  total_marks  percentage grade  age
5       8          400        80.0     B   23
6       9          400        80.0     B   23
7      10          400        80.0     B   23

**Concatenate DataFrames together verticallys**

In [60]:

data3 = {
    'name': ['Amit', 'Neha', 'Vikas', 'Meena', 'Rohit'],
    'rollno': [6, 7, 8, 9, 10],
    'age': [23, 20, 22, 21, 25],
    'height': [172, 160, 178, 165, 169]
}
df3 = pd.DataFrame(data3)

# print(df3)


ver = pd.concat([df1,df3],keys=['df1','df3'])
print(f"\n{ver}")   # index of the table are wrong aline

ver_join = pd.concat([df1,df3],ignore_index=True)
print(f"\n{ver_join}")

        name  rollno  age  height
df1 0    Ram       1   20     160
    1  Samir       2   21     170
    2  Pawan       3   19     165
    3   Sita       4   22     180
    4   Rita       5   24     158
df3 0   Amit       6   23     172
    1   Neha       7   20     160
    2  Vikas       8   22     178
    3  Meena       9   21     165
    4  Rohit      10   25     169

    name  rollno  age  height
0    Ram       1   20     160
1  Samir       2   21     170
2  Pawan       3   19     165
3   Sita       4   22     180
4   Rita       5   24     158
5   Amit       6   23     172
6   Neha       7   20     160
7  Vikas       8   22     178
8  Meena       9   21     165
9  Rohit      10   25     169

**Using merge_ordered()**

In [70]:
pd.merge_ordered(df1,df2,on='rollno',how='right')

    name  rollno  age_x  height  total_marks  percentage grade  age_y
0    Ram       1   20.0   160.0          450        90.0     A     20
1  Samir       2   21.0   170.0          380        76.0     B     22
2  Pawan       3   19.0   165.0          290        58.0     C     19
3   Sita       4   22.0   180.0          410        82.0     A     21
4   Rita       5   24.0   158.0          320        64.0     B     24
5    NaN       8    NaN     NaN          400        80.0     B     23
6    NaN       9    NaN     NaN          400        80.0     B     23
7    NaN      10    NaN     NaN          400        80.0     B     23

In [71]:
#  fill_methos ffill fill the nan with uper value or forward value
pd.merge_ordered(df1, df2, on='rollno', how='right', fill_method='ffill')

    name  rollno  age_x  height  total_marks  percentage grade  age_y
0    Ram       1     20     160          450        90.0     A     20
1  Samir       2     21     170          380        76.0     B     22
2  Pawan       3     19     165          290        58.0     C     19
3   Sita       4     22     180          410        82.0     A     21
4   Rita       5     24     158          320        64.0     B     24
5   Rita       8     24     158          400        80.0     B     23
6   Rita       9     24     158          400        80.0     B     23
7   Rita      10     24     158          400        80.0     B     23

**Using merge_asof()**  
Similar to a merge_ordered() left join Similar features as merge_ordered()  
left keys and righy keys must be sorted

In [75]:
pd.merge_asof(df1, df2, on='rollno')

    name  rollno  age_x  height  total_marks  percentage grade  age_y
0    Ram       1     20     160          450        90.0     A     20
1  Samir       2     21     170          380        76.0     B     22
2  Pawan       3     19     165          290        58.0     C     19
3   Sita       4     22     180          410        82.0     A     21
4   Rita       5     24     158          320        64.0     B     24

**Selecting data with.query()**

In [ ]:
df2.query('percentage >80')

   name  rollno  age_x  height  total_marks  percentage grade  age_y
0   Ram       1     20     160          450        90.0     A     20
3  Sita       4     22     180          410        82.0     A     21

In [78]:
pd.merge_asof(df1, df2, on='rollno').query('percentage >80')

   name  rollno  age_x  height  total_marks  percentage grade  age_y
0   Ram       1     20     160          450        90.0     A     20
3  Sita       4     22     180          410        82.0     A     21

In [88]:
pd.merge_asof(df1, df2, on='rollno').query('grade =="A" or grade=="B"')

    name  rollno  age_x  height  total_marks  percentage grade  age_y
0    Ram       1     20     160          450        90.0     A     20
1  Samir       2     21     170          380        76.0     B     22
3   Sita       4     22     180          410        82.0     A     21
4   Rita       5     24     158          320        64.0     B     24

**Reshaping data with.melt()**

In [93]:
print(df2.melt(id_vars=['rollno','grade']).head())
print(df1.melt(id_vars=['name','rollno'],var_name = 'height/age'))

   rollno grade     variable  value
0       1     A  total_marks  450.0
1       2     B  total_marks  380.0
2       3     C  total_marks  290.0
3       4     A  total_marks  410.0
4       5     B  total_marks  320.0
    name  rollno height/age  value
0    Ram       1        age     20
1  Samir       2        age     21
2  Pawan       3        age     19
3   Sita       4        age     22
4   Rita       5        age     24
5    Ram       1     height    160
6  Samir       2     height    170
7  Pawan       3     height    165
8   Sita       4     height    180
9   Rita       5     height    158